---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyleOverrideOptions.TextOrientation
source: html/c391edf6-0c21-4bc0-b547-483b5fd105c4.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.TextOrientation Property

Indicates if the text orientation characteristic is overridden.

## Syntax (C#)
```csharp
public bool TextOrientation { get; set; }
```